Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This method siginfies that a nested scrolling child has detected a fling with the given velocity along each axis.
zh_cn: 此方法表明嵌套滚动子项已检测到沿每个轴具有给定速度的 fling。

source: This method signifies that a nested scrolling child has detected suitable conditions for a fling.
zh_cn: 此方法表示嵌套滚动子 view 已检测到适合的条件。

source: This method was deprecated in API level 15.
zh_cn: 此方法在 API 级别 15 中已弃用。

source: This method was deprecated in API level 23.
zh_cn: 此方法在 API 级别 23 中已弃用。

source: This method was deprecated in API level 24.
zh_cn: 此方法在 API 级别 24 中已弃用。

source: This method was deprecated in API level 26.1.0.
zh_cn: 此方法在 API 级别 26.1.0 中已弃用。

source: This method will be called after onStartNestedScroll returns true.
zh_cn: 在 onStartNestedScroll 返回 true 之后将调用此方法。

source: This method will be called in response to a descendant view invoking startNestedScroll(View, int).
zh_cn: 当后代 view 调用 startNestedScroll(View, int) 时将调用此方法响应。

source: This method will be called when a nested scroll stops, for example when a nested touch scroll ends with a ACTION_UP or ACTION_CANCEL event.
zh_cn: 当嵌套滚动停止时，将调用此方法，例如当嵌套的触摸滚动以 ACTION_UP 或 ACTION_CANCEL 事件结束时。

source: This method will be called when the ViewParent's current nested scrolling child view dispatches a nested scroll event.
zh_cn: 当 ViewParent 的当前嵌套滚动子 view 分发嵌套滚动事件时，将调用此方法。

source: This method will return a zero-length array if this thread has not started, has started but has not yet been scheduled to run by the system, or has terminated.
zh_cn: 该方法将返回一个零长度的数组，如果该线程尚未启动，已启动但尚未被计划运行，或已终止。

source: This method will return the empty string when such a group successfully matches the empty string in the input.
zh_cn: 当这种组成功匹配输入中的空字符串时，此方法将返回空字符串。

source: This method will return the empty string when the pattern successfully matches the empty string in the input.
zh_cn: 当模式成功匹配输入中的空字符串时，此方法将返回空字符串。

source: This method will still continue to be called if the type is TYPE_TOUCH.
zh_cn: 如果类型为 TYPE_TOUCH，则仍将继续调用此方法。

source: This method's parameters are View.MeasureSpec values that tell you how big your view's parent wants your view to be, and whether that size is a hard maximum or just a suggestion.
zh_cn: 此方法的参数是 View.MeasureSpec 值，用于告诉你 view 的父级想要 view 的大小，以及该大小是最大值还是仅仅是建议。

source: This motivates a mode for interaction named 'touch mode'.
zh_cn: 这促使了一种名为 'touch mode' 的交互模式。

source: This new ViewHolder should be constructed with a new View that can represent the items of the given type.
zh_cn: 这个新的 ViewHolder 应该用一个新 View 来构造，该 View 可以表示给定类型的项。

source: This object holds two children: a set of tab labels that the user clicks to select a specific tab, and a FrameLayout object that displays the contents of that page.
zh_cn: 此对象包含两个子项：用户单击以选择特定选项卡的一组选项卡标签，以及显示该页面内容的 FrameLayout 对象。

source: This offers an opportunity for the application to apply a custom transformation to the page views using animation properties.
zh_cn: 这为应用程序提供了机会，可以使用动画属性来自定义转换效果。

source: This only works on LOLLIPOP devices when we set to fit system windows.
zh_cn: 当我们设置为适合系统窗口时，这仅适用于 LOLLIPOP 设备。

source: This overview of FileProvider includes the following topics:
zh_cn: FileProvider 的这个概述包括以下主题：

source: This padding amount is equal to maxCardElevation + (1 - cos45) * cornerRadius on the sides and maxCardElevation * 1.5 + (1 - cos45) * cornerRadius on top and bottom.
zh_cn: 此 padding 量在侧面等于 maxCardElevation + (1 - cos45) * cornerRadius ，在顶部和底部等于 maxCardElevation * 1.5 + (1 - cos45) * cornerRadius。

source: This page defines more types of resources you can externalize, including:
zh_cn: 此页面定义了可以外部化的更多类型的资源，包括：

source: This page shows how to convert images to WebP format and how to convert WebP images to PNG format.
zh_cn: 此页面显示如何将图像转换为 WebP 格式以及如何将 WebP 图像转换为 PNG 格式。

source: This parameter will never be null.
zh_cn: 此参数永远不会为 null。

source: This preserves the same navigation left, actions right structure present in the Action Bar and elsewhere.
zh_cn: 这将保留与操作栏以及其他位置中的相同的左侧导航，右侧操作结构。

source: This prevents the pressed state from appearing when the user is actually trying to scroll the content.
zh_cn: 这可以防止当用户实际尝试滚动内容时出现按下状态。

source: This public recycle method tries to make view recycle-able since layout manager intended to recycle this view (e.g. even if it is in scrap or change cache)
zh_cn: 此公共回收方法尝试使 view 可回收，因为布局管理器打算回收此 view (例如，即使它处于废弃或更改缓存中)

source: This returns whether setDecodeAsAlphaMaskEnabled(boolean) was set to true.
zh_cn: 这将返回 setDecodeAsAlphaMaskEnabled(boolean) 是否设置为 true。

source: This saves LayoutManager from tracking adapter changes to calculate animations.
zh_cn: 这样做可以节省 LayoutManager 在追踪 adapter 的改变以计算动画时。

source: This scrim is only shown when we have been given a top system inset.
zh_cn: 这个稀松布只在我们获得顶级系统内插时显示。

source: This section discusses how to define custom attributes and specify their values.
zh_cn: 本节讨论如何定义自定义属性并指定其值。

source: This section discusses several issues that often affect apps’ startup performance.
zh_cn: 本节讨论通常会影响应用程序启动性能的几个问题。

source: This section discusses these methods as well as several other ways that you can reduce the resources in your app to decrease the overall size of your APK.
zh_cn: 本节讨论这些方法以及其他几种可以减少应用中资源以减少 APK 总体大小的方法。

source: This sentence should start with a third person descriptive verb.
zh_cn: 句式应以第三人称描述性动词开头。

source: This set of layout parameters defaults the width and the height of the children to ViewGroup.LayoutParams.WRAP_CONTENT when they are not specified in the XML file.
zh_cn: 当在 XML 文件中未指定子项时，这组布局参数将子项的宽度和高度默认为 ViewGroup.LayoutParams.WRAP_CONTENT。

source: This set of layout parameters enforces the width of each child to be ViewGroup.LayoutParams.MATCH_PARENT and the height of each child to be ViewGroup.LayoutParams.WRAP_CONTENT, but only if the height is not specified.
zh_cn: 这组布局参数强制每个子节点的宽度为 ViewGroup.LayoutParams.MATCH_PARENT，并且每个子节点的高度为 ViewGroup.LayoutParams.WRAP_CONTENT，但仅限未指定高度时。

source: This sets the color value to be the correct color and opacity to match the correct color theming that will be applied on API level 23 and up.
zh_cn: 这会将颜色值设置为正确的颜色和不透明度，以匹配将在 API 级别 23 及更高级别上应用的正确颜色主题。

source: This shows the app:checkedIcon and changes the overlay color.
zh_cn: 这显示 app:checkedIcon 并更改叠加颜色。

source: This simple Tokenizer can be used for lists where the items are separated by a comma and one or more spaces.
zh_cn: 这个简单的 Tokenizer 可用于列表，其中项目由逗号和一个或多个空格分隔。

source: This sits on top of the asset manager of the application (accessible through getAssets()) and provides a high-level API for getting typed data from the assets.
zh_cn: 它位于应用程序的 asset (后文可能译为资产) 管理器之上(可通过 getAssets() 访问)，并提供用于从资产中获取类型化数据的高级 API。

source: This sort of poor experience may cause a user to rate your app poorly on the Play store, or even abandon your app altogether.
zh_cn: 这种糟糕的体验可能会导致用户在 Play 商店中对你的应用评分不佳，甚至完全放弃你的应用。

source: This step is necessary because all gestures begin with an onDown() message.
zh_cn: 此步骤是必要的，因为所有手势都以 onDown() 消息开头。

source: This style makes it easier to see exactly what cases are being tested.
zh_cn: 这种样式可让你更容易看出正在测试的情况。

source: This style should only be used with a start-aligned icon button.
zh_cn: 此样式只能与开始对齐的图标按钮一起使用。

source: This style was chosen such that:
zh_cn: 这种样式是按以下原则选取的：

source: This subdirectory is the same as the value returned by Context.getFilesDir().
zh_cn: 该子目录与 Context.getFilesDir() 返回的值相同。

source: This supports all formats, but merely crops the output.
zh_cn: 这支持所有格式，但只是裁剪输出。

source: This technique is slightly more complex to set up, but it works more closely with the animation system and doesn't require potentially unnecessary view invalidation.
zh_cn: 这种技术设置稍微复杂一些，但它与动画系统的关系更为密切，并且不需要潜在的不必要的 view 失效调用。

source: This technique requires that you compute scroll offsets in onDraw() and call postInvalidate() every time the scroll offset changes.
zh_cn: 此技术要求你在 onDraw() 中计算滚动偏移，并在每次滚动偏移时调用 postInvalidate() 变化。

source: This tells the system that we want the left side of button B to be constrained to the right side of button A. Such a position constraint means that the system will try to have both sides share the same location.
zh_cn: 这告诉系统，我们希望按钮 B 的左侧被限制在按钮 A 的右侧。这样的位置约束意味着系统将尝试使双方共享相同的位置。

source: This type conversion preserves all of the type safety benefits of enums.
zh_cn: 此类型转换保留了枚举的所有类型安全优势。

source: This type of start presents the greatest challenge in terms of minimizing startup time, because the system and app have more work to do than in the other launch states.
zh_cn: 这种类型的启动在最小化启动时间方面提出了最大的挑战，因为系统和应用程序比其他启动状态有更多的工作要做。

source: This unit of measure is not recommended because the actual representation can vary across devices; each devices may have a different number of pixels per inch and may have more or fewer total pixels available on the screen.
zh_cn: 建议不要使用此计量单位，因为实际展示可能因设备而不同；每个设备每英寸可以有不同数量的像素，并且在屏幕上可以有更多或更少的总像素。

source: This value may be null.
zh_cn: 该值可能是 null。

source: This value must never be null.
zh_cn: 该值绝不能为 null。

source: This value represents the amount of time elapsed between launching the process and finishing drawing the corresponding activity on the screen.
zh_cn: 此值表示启动进程和完成在屏幕上绘制相应 activity 之间所经过的时间量。

source: This value will never be null.
zh_cn: 该值永远不会是 null。

source: This version of the pager is best for use when there are a handful of typically more static fragments to be paged through, such as a set of tabs.
zh_cn: 这个版本的 pager 最适用于有一小部分的静态 fragments 需要分页显示的情况，比如一组 tabs。

source: This version of the pager is more useful when there are a large number of pages, working more like a list view.
zh_cn: 当有大量页面时，这个版本的 pager 更有用，它工作更像 list view。

source: This view also supports being used as part of a ViewPager's decor, and can be added directly to the ViewPager in a layout resource file like so:
zh_cn: 此 view 还支持用作 ViewPager 的装饰的一部分，并且可以直接添加到布局资源文件中的 ViewPager，如下所示：

source: This view depends heavily on being used as a direct child within a CoordinatorLayout.
zh_cn: 此 view 在很大程度上取决于在 CoordinatorLayout 中用作直接子项。

source: This view determines focusability automatically.
zh_cn: 此 view 自动确定可聚焦性。

source: This view does not want keystrokes.
zh_cn: 此 view 不需要按键。

source: This view honors the 24-hour format system setting.
zh_cn: 此 view 表示 24 小时格式系统设置。

source: This view id must correspond to an arbitrary descendant of the CoordinatorLayout, but it may not be the anchored child itself or a descendant of the anchored child.
zh_cn: 此 view 的 id 必须对应于 CoordinatorLayout 的任意后代，但它可能不是锚定子项本身或锚定子项的后代。

source: This view is gone, and will not take any space for layout purposes.
zh_cn: view 是 gone 的，不会为了布局而占用任何空间。

source: This view is invisible, and it doesn't take any space for layout purposes.
zh_cn: 此 view 不可见，并且不需要任何空间用于布局。

source: This view is invisible, but it still takes up space for layout purposes.
zh_cn: 该 view 是不可见的，但它仍然占用空间进行布局。

source: This view is not actually added to TabLayout, it is just a dummy which allows setting of a tab items's text, icon and custom layout.
zh_cn: 此 view 实际上并未添加到 TabLayout，它只是一个虚拟对象，允许设置选项卡项的文本，图标和自定义布局。

source: This view is visible.
zh_cn: view 是可见的。

source: This view wants keystrokes.
zh_cn: 这个 view 需要按键。

source: This view will also be made the target of the gesture and will be forced to match both the width and the height supplied in this layout.
zh_cn: 此 view 也将成为手势的目标，并将强制匹配此布局中提供的宽度和高度。

source: This was deemed bad.
zh_cn: 这样相当不方便。

source: This way, devices don't receive assets for features that the devices don't have.
zh_cn: 这样，设备不会接收设备所没有的功能的资源。

source: This way, if ViewHolder was holding valid information before being recycled, you can call ViewHolder#getAdapterPosition() to get its adapter position.
zh_cn: 这样，如果 ViewHolder 在被回收之前持有有效信息，则可以调用 ViewHolder#getAdapterPosition() 来获取其适配器位置。

source: This widget display an analogic clock with two hands for hours and minutes.
zh_cn: 这个小部件用双手显示模拟时钟，持续数小时和分钟。

source: This widget does not support auto-sizing text.
zh_cn: 此小部件不支持自动调整大小的文本。

source: This widget is a layout that contains several specifically-named child views that handle keyboard entry interpreted as standard phone dialpad digits.
zh_cn: 此窗口小部件是一种布局，其中包含几个专门命名的子 view，这些子 view 处理解释为标准电话拨号盘数字的键盘输。

source: This widget is merely a simple wrapper around a long-press handler.
zh_cn: 这个小部件只是一个包装长按处理程序的简单包装器。

source: This widget is no longer supported.
zh_cn: 不再支持此小部件。

source: This widget provides a simple utility for turning a continued long-press event into a series of clicks at some set frequency.
zh_cn: 此小部件提供了一个简单的实用程序，用于将持续的长按事件转换为某个设定频率的一系列点击。

source: This will always result in the returned bitmap having a density set for it (see Bitmap.setDensity(int)).
zh_cn: 这将始终导致返回的位图具有为其设置的密度（请参见 Bitmap.setDensity(int)）。

source: This will apply similarly for vertical constraints.
zh_cn: 这将适用于纵向约束。

source: This will be called on the same thread as decodeBitmap before that method returns.
zh_cn: 在该方法返回之前，将在与 decodeBitmap 相同的线程上调用此方法。

source: This will be called on the same thread as decodeDrawable before that method returns.
zh_cn: 在该方法返回之前，将在与 decodeDrawable 相同的线程上调用此方法。

source: This will be used as the resource ID.
zh_cn: 这将用作资源 ID。

source: This will be used to describe the collapse action to users through mechanisms such as screen readers or tooltips.
zh_cn: 这将用于通过屏幕阅读器或工具提示等机制向用户描述折叠操作。

source: This will be used to describe the navigation action to users through mechanisms such as screen readers or tooltips.
zh_cn: 这将用于通过屏幕阅读器或工具提示等机制向用户描述导航操作。

source: This will cause a call to onScrollChanged(int, int, int, int) and the view will be invalidated.
zh_cn: 这将导致调用 onScrollChanged(int, int, int, int)，view 将失效。

source: This will ensure consistent system behavior, including:
zh_cn: 这将确保一致的系统行为，包括：

source: This will normally identify an offending class that has an awkward interface.
zh_cn: 这通常会标识出是哪个违规类使用了糟糕的接口。

source: This will sample or scale the output to an arbitrary size that may be smaller or larger than the encoded size.
zh_cn: 这将采样或缩放输出为可能小于或大于编码大小的任意大小。

source: This will use the closest Bitmap.Config for the encoded source.
zh_cn: 这将使用最接近的 Bitmap.Config 作为编码源。

source: Those constraints allow you to position a given widget relative to another one.
zh_cn: 这些限制允许你相对其他部件来定位给定的布件。

source: Though you do have to keep two copies of the list in memory while diffing, and must avoid mutating them, it's possible to share unmodified elements between list versions.
zh_cn: 虽然在进行差异时你必须在内存中保留两个列表副本，并且必须避免改变它们，但是可以在列表版本之间共享未修改的元素。

source: Throughout the API, grid lines are referenced by grid indices.
zh_cn: 在整个 API 中，网格线由网格 indices (索引) 引用。

source: Throw a new exception that's appropriate to your level of abstraction.
zh_cn: 抛出一个适合你的抽象级别的新异常。

source: Throw away all previous state when starting a new touch gesture.
zh_cn: 当开始一个新的触摸手势时，扔掉所有以前的状态。

source: Throw the exception up to the caller of your method.
zh_cn: 将异常抛给方法调用者。

source: Throws
zh_cn: 抛出

source: Thus opaque-black would be 0xFF000000 (100% opaque but no contributions from red, green, or blue), and opaque-white would be 0xFFFFFFFF
zh_cn: 因此，不透明的黑色将是 0xFF000000(100％不透明但没有红色，绿色或蓝色的贡献)，而不透明的白色将是 0xFFFFFFFF

source: Time to full display
zh_cn: 完全显示时间

source: Time to initial display
zh_cn: 初始显示的时间

source: Time, in milliseconds, to wait before the gesture fades out after the user is done drawing it.
zh_cn: 在用户完成绘制之后手势淡出之前等待的时间(以毫秒为单位)。

source: Time, relative to getNanoTime(), by which bind/create work should complete.
zh_cn: 时间，相对于 getNanoTime()，绑定/创建工作应在该时间之前完成。

source: Timeout between frames of animation in milliseconds.
zh_cn: 动画帧之间的超时(以毫秒为单位)。

source: Tint to apply to the background.
zh_cn: 着色器应用于背景。

source: Tint to apply to the button graphic.
zh_cn: 色调应用于按钮图形。

source: Tint to apply to the check mark.
zh_cn: 色调适用于复选标记。

source: Tint to apply to the foreground.
zh_cn: 着色器应用于前景。

source: Tint to apply to the indeterminate progress indicator.
zh_cn: 色彩适用于不确定的进度指标。

source: Tint to apply to the progress indicator background.
zh_cn: 色调适用于进度指示器背景。

source: Tint to apply to the progress indicator.
zh_cn: 色调适用于进度指示器。

source: Tint to apply to the secondary progress indicator.
zh_cn: 色调适用于次要进度指示器。

source: Tint to apply to the thumb drawable.
zh_cn: 适用于thumb drawable 的色调。

source: Tint to apply to the thumb.
zh_cn: 适用于拇指的色调。

source: Tint to apply to the tick mark drawable.
zh_cn: 色调适用于刻度标记 drawable。

source: Tint to apply to the track.
zh_cn: 色调适用于赛道。

source: To add a built-in View to your user interface, you specify it in an XML element and control its appearance and behavior with element attributes.
zh_cn: 要将内置的 View 添加到用户界面，可以在 XML 元素中指定它并使用元素属性控制其外观和行为。

source: To add multiple views within the scroll view, make the direct child you add a view group, for example LinearLayout, and place additional views within that LinearLayout.
zh_cn: 要在 scroll view 中添加多个 view，请为直接子项添加 view group，例如 LinearLayout，并在该 LinearLayout 中放置其他 view。

source: To address this concern, you can manually call reportFullyDrawn() to let the system know that your activity is finished with its lazy loading.
zh_cn: 要解决此问题，你可以手动调用 reportFullyDrawn()，让系统知道你的activity已完成延迟加载。

source: To allow Android Studio to interact with your view, at a minimum you must provide a constructor that takes a Context and an AttributeSet object as parameters.
zh_cn: 要允许 Android Studio 与你的 view 进行交互，你必须至少提供一个构造函数，该构造函数接受 Context 和 AttributeSet 对象作为参数。

source: To avoid a UI that feels sluggish or stutters during playback, ensure that animations consistently run at 60 frames per second.
zh_cn: 为避免在播放过程中感觉迟缓或不流畅的 UI，请确保动画始终以每秒 60 帧的速度运行。

source: To avoid moving the View while shadow size is changing, shadow size is clamped by getMaxCardElevation().
zh_cn: 为避免在阴影大小发生变化时移动 view，阴影大小会被 getMaxCardElevation() 限制。

source: To avoid these gaps, StaggeredGridLayoutManager can offset spans independently or move items between spans.
zh_cn: 为了避免这些间距，StaggeredGridLayoutManager 可以单独地设置间距偏移，或在间距间移动 items。

source: To avoid unintended behavior, call setHint(CharSequence) and getHint() on TextInputLayout, instead of on EditText.
zh_cn: 要避免意外行为，请在 TextInputLayout 上调用 setHint(CharSequence) 和 getHint()，而不是在 EditText 上调用。

source: To be called only during onLayoutChildren(Recycler, State) to add a view to the layout that is known to be going away, either because it has been removed or because it is actually not in the visible portion of the container but is being laid out in order to inform RecyclerView in how to animate the item out of view.
zh_cn: 只在 onLayoutChildren(Recycler, State) 期间调用，以给 layout 添加一个看不见的 view。要么因为它被 removed 或者因为它实际上不在容器的可见部分中，但它正在被布置以便通知 RecyclerView 如何把 item view 动画出去。

source: To be more precise, GridLayout treats each of its layout parameters as a constraint in the a set of variables that define the grid-lines along a given axis.
zh_cn: 更确切地说，GridLayout 将其每个布局参数视为一组变量中的约束，这些变量定义了沿给定轴的网格线。

source: To change CardView's elevation in a backward compatible way, use setCardElevation(float).
zh_cn: 要以向后兼容的方式更改 CardView 的高程，请使用 setCardElevation(float)。

source: To change the default settings, pass the Source and an OnHeaderDecodedListener to decodeDrawable(Source, OnHeaderDecodedListener) or decodeBitmap(Source, OnHeaderDecodedListener).
zh_cn: 要更改默认设置，请将 Source 和 OnHeaderDecodedListener 传递给 decodeDrawable(Source, OnHeaderDecodedListener) 或 decodeBitmap(Source, OnHeaderDecodedListener)。

source: To change whether a view can take focus, call setFocusable(boolean).
zh_cn: 要改变一个 view 是否可以获取焦点，调用 setFocusable(boolean) 方法。

source: To clarify the difference between the different lines, the left and top lines define which pixels of the image are allowed to be replicated in order to stretch the image.
zh_cn: 要区分不同的线，左边和上边的线定义了哪些像素可以被复制以伸缩图形。

source: To compress JPEG files, you can use tools like packJPG and guetzli.
zh_cn: 要压缩 JPEG 文件，你可以使用 packJPG 和 guetzli 等工具。

source: To control how linear layout aligns all the views it contains, set a value for android:gravity.
zh_cn: 要控制线性布局如何对齐它包含的所有 view，请为 android:gravity 设置一个值。

source: To convert a WebP image to PNG, proceed as follows:
zh_cn: 要将 WebP 图像转换为 PNG，请执行以下操作：

source: To convert an existing layout to a constraint layout, follow these steps:
zh_cn: 要将现有布局转换为约束布局，请按照下列步骤操作：

source: To convert an image or folder of images, proceed as follows:
zh_cn: 要转换图像或图像文件夹，请按以下步骤操作：

source: To convert raw touch events into gestures, Android provides GestureDetector.
zh_cn: 要将原始触摸事件转换为手势，Android 提供 GestureDetector。

source: To create a BitmapRegionDecoder, call newInstance(...).
zh_cn: 要创建 BitmapRegionDecoder，请调用 newInstance(...)。

source: To create a chain of views quickly, select them all, right-click one of the views, and then select either Center Horizontally or Center Vertically, to create either a horizontal or vertical chain, respectively (see video 4).
zh_cn: 要快速创建 view 链，全选它们，右键单击其中一个 view，然后选择 Center Horizontally 或 Center Vertically，来分别创建水平或垂直链(参见视频 4)。

source: To create a compound component:
zh_cn: 要创建一个组合组件：

source: To create a fully customized component:
zh_cn: 要创建一个完全自定义的组件：

source: To create a minimal download for your users, you can segment your app into several APKs, differentiated by factors such as screen size or GPU texture support.
zh_cn: 要为用户创建最小的下载，你可以将应用划分为多个 APK，区别在于屏幕尺寸或 GPU 纹理支持等因素。

source: To customize the appearance of TextView, see Styles and Themes.
zh_cn: 要自定义 TextView 的外观，请参阅 Styles and Themes。

source: To define a view's position in ConstraintLayout, you must add at least one horizontal and one vertical constraint for the view.
zh_cn: 要在 ConstraintLayout 中定义 view 的位置，你必须为 view 添加至少一个水平和垂直的约束。

source: To define custom attributes, add <declare-styleable> resources to your project.
zh_cn: 要定义自定义属性，请将 <declare-styleable> 资源添加到项目中。

source: To disable the gesture and progress animation, call setEnabled(false) on the view.
zh_cn: 要禁用手势和进度动画，请在 view 上调用 setEnabled(false)。

source: To disable user input you should set
zh_cn: 要禁用用户输入，你应该设置

source: To display a button in an activity, add a button to the activity's layout XML file:
zh_cn: 要在 activity 中显示按钮，请在 activity 的布局 XML 文件中添加一个按钮：

source: To display a list, you can include a list view in your layout XML file:
zh_cn: 要显示列表，可以在布局 XML 文件中包含列表 view：

source: To display a more custom view for each item in your dataset, implement a ListAdapter.
zh_cn: 要为数据集中的每个项目显示更多自定义 view，请实现 ListAdapter。

source: To display the tab, you need to add it to the layout via one of the addTab(Tab) methods.
zh_cn: 要显示选项卡，你需要通过 addTab(Tab) 方法之一将其添加到布局中。

source: To display updatable data in a RecyclerView, your adapter needs to signal inserts, moves, and deletions to RecyclerView.
zh_cn: 要在 RecyclerView 中显示可更新数据，你的适配器需要向 RecyclerView 发送插入，移动和删除信号。

source: To do so, use a Spanned object.
zh_cn: 为此，使用 Spanned 对象。

source: To do this, call Intent.setClipData().
zh_cn: 要这样做，请调用 Intent.setClipData() 。

source: To enable color theming for menu items you will also need to set the materialThemeOverlay attribute to a ThemeOverlay which sets the colorControlNormal attribute to the correct color.
zh_cn: 要为菜单项启用颜色主题，你还需要将 materialThemeOverlay 属性设置为 ThemeOverlay，它将 colorControlNormal 属性设置为正确的颜色。

source: To enable the ratio, click Toggle Aspect Ratio Constraint (callout 1 in figure 10), and then enter the width:height ratio in the input that appears.
zh_cn: 要启用比率，点击 Toggle Aspect Ratio Constraint (如图 10 中的编号 1)，然后在出现的输入框中输入 width:height 。

source: To enable this behavior in your custom view, you must:
zh_cn: 要在自定义 view 中启用此行为，你必须：

source: To enable touch filtering, call setFilterTouchesWhenObscured(boolean) or set the android:filterTouchesWhenObscured layout attribute to true.
zh_cn: 要启用触摸过滤，调用 setFilterTouchesWhenObscured(boolean) 方法，或者设置 android:filterTouchesWhenObscured 布局属性为 true。

source: To enforce security, this value hides the name of the subdirectory you're sharing.
zh_cn: 为了加强安全性，该值将隐藏你要共享的子目录的名称。
